# n = int(input('Сколько км проезжает км за день?: '))
# m = int(input('Сколько км надо проехать?: '))

# day = -(-m//n)

# print(f'необходимо {day} день')

# Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO.
# В соответствии с григорианским календарем, год является високосным, если
# его номер кратен 4, но не кратен 100; или если он кратен 400.
# # 1. Записать условие для високосного года в одну строку
# # 2. Записать условие с использованием двух булевых переменных (по одной для каждой части условия)
# # 3. Усложнение [*] Использовать тернарный оператор

# year = int( input('Введите год: '))

# if (year//4):
#     print('yes') if year %4 == 0 and year %100 !=0 or year  %400 ==0 else print ('no')

#  Вагоны в электричке пронумерованы натуральными числами, начиная с 1

# (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка).

# В каждом вагоне написан его номер. Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j.

# Он хочет определить, сколько всего вагонов в электричке.

# Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.

# Примеры/Тесты:

# i=3 j=4 (ввод на разных строках) -> В поезде 6 вагонов

# i=6 j=2 (ввод на разных строках) -> В поезде 7 вагонов   

# i = int(input("Input ticket number: ")) 
# j = int(input("Input train number: "))
# if i==j:
#     print("Error") 
# else:
#     print(f"{j+i-1}")    